# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2fCIB, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2fCIB, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2fCIB, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2fCIB, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True]] # 22 (P5/32-large)

# --- 核心修改区 ---

  # 1. P3 分支：只保留 AVIB (轻量级)
  - [ 16, 1, AVIB, [ 256 ] ]        # 23: AVIB Output (P3)

  # 2. P4 分支：只保留 AVIB (轻量级)
  - [ 19, 1, AVIB, [ 512 ] ]        # 24: AVIB Output (P4)

  # 3. P5 分支：AVIB -> FourierKAN (重点增强这一层)
  - [ 22, 1, AVIB, [ 1024 ] ]       # 25: AVIB Output (P5)
  - [ 25, 1, FourierKAN, [ 1024 ] ] # 26: FourierKAN Output (P5), 输入来自 25

  # Detect Head
  # 输入来源变为:
  # P3 -> 23 (AVIB)
  # P4 -> 24 (AVIB)
  # P5 -> 26 (AVIB + KAN)
  - [[23, 24, 26], 1, v10Detect, [nc]]